EDT/УТ/src/AccumulationRegisters/ВзаиморасчетыСКомитентами/ВзаиморасчетыСКомитентами.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>ВзаиморасчетыСКомитентами</name>
  <resources>
    <name>Сумма</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <attributes>
    <name>Корректировка</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <dimensions>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Комитент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ДатаВозникновенияЗадолженности</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>СтатьяРасчетовСКомитентами</name>
    <type>
      <types>CatalogRef.СтатьиРасчетовСКомитентами</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

EDT/УТ/src/AccumulationRegisters/ВзаиморасчетыСКомитентами/RecordSetModule.bsl
Процедура СоздатьДвижения(Объект, ТаблицаДвижений = Неопределено, ОчищатьСтатьюРасчетов = Истина) Экспорт
	
	Объект.Движения.ВзаиморасчетыСКомитентами.Записывать = Истина;
	Объект.Движения.ВзаиморасчетыСКомитентами.Очистить();
	
	Если Не ТаблицаДвижений = Неопределено Тогда
		
		Если ТаблицаДвижений.Количество() = 0 Тогда
			Возврат;
		КонецЕсли;
		
		КолонкиСверки = РегистрыНакопления.ВзаиморасчетыСКомитентами.ТаблицаДвиженийПоРегистру(Истина);
		Если ОчищатьСтатьюРасчетов Тогда
			КолонкиСверки = СтрЗаменить(КолонкиСверки, "СтатьяРасчетовСКомитентами,","");
		КонецЕсли;
		ТаблицаДвижений.Свернуть(КолонкиСверки, "Сумма");

		СтатьяРасчетовСКомитентами = Справочники.СтатьиРасчетовСКомитентами.ВыручкаПоЗаказам;
								
		Если ТипЗнч(Объект) = Тип("ДокументОбъект.ДанныеЗаказаСамовывоза")
			ИЛИ ТипЗнч(Объект) = Тип("ДокументОбъект.ПриходДСПоОтчетуВодителя")
			ИЛИ ТипЗнч(Объект) = Тип("ДокументОбъект.ПечатьЧековПоДоставкам") Тогда	
						
			Для Каждого СтрокаДвижения Из  ТаблицаДвижений Цикл
				
			    Движение = Объект.Движения.ВзаиморасчетыСКомитентами.ДобавитьПриход();
				ЗаполнитьЗначенияСвойств(Движение, СтрокаДвижения);
				Движение.Период = Объект.Дата;
				Движение.Регистратор = Объект.Ссылка;
				Движение.СтатьяРасчетовСКомитентами = СтатьяРасчетовСКомитентами;
				
			КонецЦикла;
			
		ИначеЕсли ТипЗнч(Объект) = Тип("ДокументОбъект.ОтражениеОплатыПоКомитентам") Тогда	
			
			//CeHbKA
			ТаблицаДвижений = Объект.Движения.ВзаиморасчетыСКомитентамиПоЗаказам.Выгрузить();
			ТаблицаДвижений.Свернуть("Период,Организация,Комитент,ДатаВозникновенияЗадолженности", "Сумма");
			
			ПериодДвижений = Объект.Дата;
			//CeHbKA
			
			Для Каждого СтрокаДвижения Из  ТаблицаДвижений Цикл
				
				ПериодДвижений = СтрокаДвижения.Период; //CeHbKA
				
				Движение = Объект.Движения.ВзаиморасчетыСКомитентами.ДобавитьРасход();
				ЗаполнитьЗначенияСвойств(Движение, СтрокаДвижения);
				//Движение.Период = Объект.Дата;
				Движение.Период = ПериодДвижений; //CeHbKA
				Движение.Регистратор = Объект.Ссылка;
				Движение.СтатьяРасчетовСКомитентами = СтатьяРасчетовСКомитентами;				
				
			КонецЦикла;
			
			Для Каждого СтрокаТЧ Из Объект.СтатьиРасчетов Цикл
				
				Если СтрокаТЧ.СтатьяРасчетов = Справочники.СтатьиРасчетовСКомитентами.ВыручкаПоЗаказам тогда 
					Продолжить;
				КонецЕсли;
				
				Движение = Объект.Движения.ВзаиморасчетыСКомитентами.ДобавитьРасход();
				ЗаполнитьЗначенияСвойств(Движение, Объект);
				ЗаполнитьЗначенияСвойств(Движение, СтрокаТЧ);
				Движение.Комитент = СтрокаТЧ.Контрагент;
				Движение.СтатьяРасчетовСКомитентами = СтрокаТЧ.СтатьяРасчетов;
				
				//Движение.Период = Объект.Дата;
				Движение.Период = ПериодДвижений; //CeHbKA
				Движение.Регистратор = Объект.Ссылка;
				
			КонецЦикла;	
			
		ИначеЕсли ТипЗнч(Объект) = Тип("ДокументОбъект.ВводДанныхПоСтатьямРасчетовСКомитентами") Тогда	
			
			Для Каждого СтрокаДвижения Из  ТаблицаДвижений Цикл
				
			    Движение = Объект.Движения.ВзаиморасчетыСКомитентами.ДобавитьПриход();
				ЗаполнитьЗначенияСвойств(Движение, СтрокаДвижения);
				Движение.Период = Объект.Дата;
				Движение.Регистратор = Объект.Ссылка;
				
			КонецЦикла;
			
		КонецЕсли;
		
	КонецЕсли;

КонецПроцедуры
